tap "alajmo/mani"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "mongodb/brew"
tap "warrensbox/tap"
brew "python@3.10"
brew "autojump"
brew "autossh"
brew "aws-vault", link: false
brew "python@3.11"
brew "awscli"
brew "bash"
brew "bat"
brew "python@3.12"
brew "glib"
brew "pycparser"
brew "cffi"
brew "harfbuzz"
brew "openjdk"
brew "clojure"
brew "unbound"
brew "gnutls"
brew "qemu"
brew "lima"
brew "colima"
brew "csvkit"
brew "direnv"
brew "docker", link: false
brew "docker-compose"
brew "docutils"
brew "wxwidgets"
brew "erlang"
brew "fd"
brew "fish"
brew "fzf"
brew "git"
brew "git-lfs"
brew "git-secrets"
brew "gitleaks"
brew "glab"
brew "go"
brew "gradle"
brew "handbrake"
brew "helm"
brew "jenv"
brew "jq"
brew "kotlin"
brew "kubernetes-cli"
brew "kubectx"
brew "leiningen"
brew "locust"
brew "mas"
brew "maven"
brew "mise"
brew "node"
brew "mongosh"
brew "node@14"
brew "node@16"
brew "openjdk@17"
brew "p7zip"
brew "pipenv"
brew "portaudio"
brew "postgresql@14", restart_service: true
brew "pre-commit"
brew "pyenv"
brew "python@3.9"
brew "tcl-tk"
brew "python-tk@3.9"
brew "rabbitmq"
brew "redis", restart_service: true
brew "restic"
brew "sbt"
brew "scala"
brew "sshuttle"
brew "thefuck"
brew "tldr"
brew "tree"
brew "virtualenv"
brew "watch"
brew "wget"
brew "yq"
brew "alajmo/mani/mani"
brew "mongodb/brew/mongodb-community"
brew "warrensbox/tap/tfswitch"
cask "adoptopenjdk11"
cask "adoptopenjdk8"
cask "alfred"
cask "android-file-transfer"
cask "appcleaner"
cask "aws-vault"
cask "caffeine"
cask "clipy"
cask "docker"
cask "dozer"
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-powerline-symbols"
cask "gimp"
cask "google-chrome"
cask "google-cloud-sdk"
cask "intellij-idea"
cask "iterm2"
cask "libreoffice"
cask "memoryanalyzer"
cask "microsoft-teams"
cask "oracle-jdk"
cask "pgadmin4"
cask "pop"
cask "postman"
cask "rectangle"
cask "robo-3t"
cask "slack"
cask "soapui"
cask "sublime-text"
cask "tableplus"
cask "temurin"
cask "tor-browser"
cask "visual-studio-code"
cask "visualvm"
cask "vlc"
cask "vnc-viewer"
cask "webex"
cask "whatsapp"
cask "xmind"
cask "zoom"
mas "Clocker", id: 1056643111
mas "Dato", id: 1470584107
mas "Free Ruler", id: 1483172210
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Meeter", id: 1510445899
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Slack", id: 803453959
vscode "redhat.java"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
