tap "alajmo/mani"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "mongodb/brew"
tap "warrensbox/tap"
brew "pycparser"
brew "cffi"
brew "tree"
brew "ansible"
brew "python@3.10"
brew "autojump"
brew "autossh"
brew "aws-vault", link: false
brew "awscli"
brew "bash"
brew "bat"
brew "glib"
brew "lima"
brew "colima"
brew "csvkit"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "docutils"
brew "erlang"
brew "fd"
brew "fish"
brew "fzf"
brew "git"
brew "git-lfs"
brew "git-secrets"
brew "gitleaks"
brew "glab"
brew "unbound"
brew "gnutls"
brew "go"
brew "harfbuzz"
brew "gradle"
brew "helm"
brew "jenv"
brew "jq"
brew "node"
brew "jupyterlab"
brew "k9s"
brew "openjdk"
brew "kotlin"
brew "kubernetes-cli"
brew "kubectx"
brew "locust"
brew "mas"
brew "maven"
brew "mise"
brew "mongosh"
brew "node@14"
brew "node@16"
brew "openjdk@17"
brew "p7zip"
brew "pgbadger"
brew "pipenv"
brew "portaudio"
brew "postgresql@14", restart_service: :changed
brew "pre-commit"
brew "pyenv"
brew "python@3.9"
brew "python-tk@3.9"
brew "python@3.11"
brew "python@3.12"
brew "qemu"
brew "redis", restart_service: :changed
brew "restic"
brew "sbt"
brew "scala"
brew "sshuttle"
brew "tcl-tk"
brew "tflint"
brew "tfsec"
brew "thefuck"
brew "tldr"
brew "trivy"
brew "uv"
brew "virtualenv"
brew "watch"
brew "wget"
brew "wxwidgets"
brew "yq"
brew "alajmo/mani/mani"
brew "hashicorp/tap/terraform"
brew "mongodb/brew/mongodb-community"
cask "alfred"
cask "appcleaner"
cask "aws-vault-binary"
cask "bitwarden"
cask "clipy"
cask "docker-desktop"
cask "dozer"
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-powerline-symbols"
cask "google-chrome"
cask "intellij-idea"
cask "iterm2"
cask "libreoffice"
cask "memoryanalyzer"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "oracle-jdk"
cask "postman"
cask "rectangle"
cask "slack"
cask "sublime-text"
cask "tableplus"
cask "temurin"
cask "visual-studio-code"
cask "visualvm"
cask "whisky"
cask "zoom"
mas "Clocker", id: 1056643111
mas "Dato", id: 1470584107
mas "Free Ruler", id: 1483172210
mas "GoPro Quik", id: 561350520
mas "NordVPN", id: 905953485
mas "Pixelmator Pro", id: 1289583905
mas "Slack", id: 803453959
mas "WhatsApp", id: 310633997
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "k--kato.intellij-idea-keybindings"
vscode "kevinrose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "redhat.java"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
